Repository: mmmylnikov/doc-fill-master
Catalog: src/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: File "{path}" not found
ru: Файл "{path}" не найден

source: Error
ru: Ошибка

source: Directory "{path}" not found
ru: Папка "{path}" не найдена

source: App variables ready
ru: Переменные приложения готовы

source: Templates loaded: {doc_templates}
ru: Шаблоны загружены: {doc_templates}

source: Invalid headers: {e}
ru: Неверные заголовки: {e}

source: Executors is loaded: {count}
ru: Исполнители загружены: {count}

source: About
ru: О программе

source: Replaceable fields
ru: Заменяемые поля

source: File {filename} not found
ru: Файл {filename} не найден

source: License
ru: Лицензия

source: Notice
ru: Условия использования

source: UI initialized
ru: UI инициализирован

source: Document type:
ru: Тип документа:

source: Document type help
ru: опциональный комментарий

source: Document type - added
ru: Тип документа - добавлен

source: Date:
ru: Дата:

source: january
ru: января

source: february
ru: февраля

source: march
ru: марта

source: april
ru: апреля

source: may
ru: мая

source: june
ru: июня

source: july
ru: июля

source: august
ru: августа

source: september
ru: сентября

source: october
ru: октября

source: november
ru: ноября

source: december
ru: декабря

source: Date - added
ru: Дата - добавлена

source: Executor:
ru: Исполнитель:

source: Executor - added
ru: Исполнитель - добавлен

source: Document number:
ru: Номер документа:

source: only numbers allowed
ru: только числа разрешены

source: Document number - added
ru: Номер документа - добавлен

source: Amount:
ru: Сумма:

source: Amount - added
ru: Сумма - добавлена

source: Create PDF
ru: Создать PDF

source: Button created
ru: Кнопка создана

source: UI created
ru: UI создан

source: Information
ru: Информация

source: Please wait...
ru: Пожалуйста, подождите...

source: Converting document
ru: Конвертация документа

source: Conversion successful
ru: Конвертация выполнена

source: File created: {file_name}
ru: Файл создан: {file_name}

source: Success
ru: Успех

source: Document created: {path}
ru: Документ создан: {path}

source: Application will be closed
ru: Приложение будет закрыто

source: Conversion failed
ru: конвертация не удалась

source: File not created
ru: Файл не создан

source: Validating fields
ru: Валидация полей

source: Document template not selected
ru: Шаблон документа не выбран

source: Date not selected
ru: Дата не выбрана

source: There are only {count} days in this month.
ru: Только {count} дней в этом месяце.

source: Executor not selected
ru: Исполнитель не выбран

source: Document number not entered or entered incorrectly
ru: Номер документа не введен или введен неправильно

source: Amount not entered or entered incorrectly
ru: Сумма не введена или введена неправильно

source: Validation passed
ru: Валидация прошла успешно

source: Fields to replaced is ready
ru: Поля для замены готовы

source: Application started
ru: Приложение запущено

source: Application closed
ru: Приложение закрыто

source: tool.doc_fill_master not found in pyproject.toml
ru: директива tool.doc_fill_master не найдена в pyproject.toml

source: project not found in pyproject.toml
ru: директива project не найдена в pyproject.toml

source: Logger initialized
ru: Логгер инициализирован

source: Words replaced in run: {text}
ru: Замена слов в строке: {text}

source: > Word "{old_word}" replaced with "{new_word}"
ru: Слово "{old_word}" заменено на "{new_word}"

source: Words replaced in paragraphs
ru: Замена слов в параграфах

source: Words replaced in tables
ru: Замена слов в таблицах

source: File {path} created
ru: Файл {path} создан

source: Start words replace in document
ru: Старт замены слов в документе

source: End words replace in document
ru: Завершение замены слов в документе

source: Start document convert
ru: Старт конвертации документа

source: End document convert
ru: Завершение конвертации документа

source: File {path} deleted
ru: Файл {path} удален

source: Document converted to {path}
ru: Документ конвертирован в {path}

source: Currency pluralize must be a list with 3 elements
ru: Фразы для вальюты должны быть списком из трех элементов

source: Headers not found
ru: заголовки не найдены

source: Wrong headers: {headers}
ru: Неверные заголовки: {headers}
